(1569960, 200)
(1569960, 1569960)
Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 200)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 200)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 1569960)]    0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 128)          25600       dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 128)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 107)          13696       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 39,296
Trainable params: 39,296
Non-trainable params: 0
__________________________________________________________________________________________________
(2048, 200)
ADJ MATRIX BEFORE (235494, 235494)
ADJ MATRIX AFTER (2048, 2048)
overall time:  0.0800025463104248
