channel_number:  512
dataset:  amazon
Train Shapes
(1255968, 200)
(1255968, 1255968)
(1255968, 107)
(1569960,)
Val Shapes
(78498, 200)
(78498, 78498)
(78498, 107)
(1569960,)
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 200)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 200)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 1569960)]    0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 512)          102400      dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 107)          54784       dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 157,184
Trainable params: 157,184
Non-trainable params: 0
__________________________________________________________________________________________________
(1569960, 200)
(1569960, 1569960)
(1569960, 107)
(1569960,)
Epoch 1/600
1/1 [==============================] - ETA: 0s - loss: 7.5397 - acc: 0.00841/1 [==============================] - 3s 3s/step - loss: 7.5397 - acc: 0.0084 - val_loss: 7.5422 - val_acc: 0.0163
