(716847, 300)
(716847, 716847)
Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 300)]        0                                            
__________________________________________________________________________________________________
dropout (Dropout)               (None, 300)          0           input_1[0][0]                    
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 716847)]     0                                            
__________________________________________________________________________________________________
gcn_conv (GCNConv)              (None, 16)           4800        dropout[0][0]                    
                                                                 input_2[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 16)           0           gcn_conv[0][0]                   
__________________________________________________________________________________________________
gcn_conv_1 (GCNConv)            (None, 100)          1600        dropout_1[0][0]                  
                                                                 input_2[0][0]                    
==================================================================================================
Total params: 6,400
Trainable params: 6,400
Non-trainable params: 0
__________________________________________________________________________________________________
test_features.shape: (65536, 300)
ADJ MATRIX BEFORE (716847, 716847)
ADJ MATRIX AFTER (65536, 65536)
overall time:  0.36870241165161133
